app/views/users/show.html.erb

    <%= render 'follow_form' if user_signed_in? %>
    <% if @user.microposts.any? %>
---
SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT 1  [["user_id", 12]]