app/views/shared/_user_notifications.html.erb

  <a id="notification-dropdown" href="#" class="dropdown-toggle" data-toggle="dropdown">
    <span class='red-number'> <%= current_user.notifications.unread.count %> </span>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = ? AND "notifications"."id" = ? ORDER BY "notifications"."created_at" DESC LIMIT 1  [["user_id", 3], ["id", 30]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = ? AND (is_read = 't')  [["user_id", 2]]

  <ul class="dropdown-menu scrollable-menu">
    <% if(current_user.notifications.any?) %>
---
SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = ? ORDER BY "notifications"."created_at" DESC LIMIT 1  [["user_id", 6]]