app/views/microposts/_micropost.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 5]]
SELECT 1 AS one FROM "comments" WHERE "comments"."micropost_id" = ? LIMIT 1  [["micropost_id", 6]]
---

  <% if micropost.comments.any? %>