app/controllers/comments_controller.rb

  def create
    micropost = Micropost.find(params[:micropost_id])
    comment = micropost.comments.build(comment_params)
    comment.user = current_user

    if comment.save
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT 1  [["id", "6"]]
INSERT INTO "comments" ("content", "created_at", "micropost_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "testing"], ["created_at", Sat, 13 Feb 2016 07:40:09 UTC +00:00], ["micropost_id", 6], ["updated_at", Sat, 13 Feb 2016 07:40:09 UTC +00:00], ["user_id", 2]]

  def destroy
    comment = Comment.find(params[:id])
    if comment && comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 9]]