app/controllers/microposts_controller.rb

  def destroy
    micropost = Micropost.find(params[:id])
    micropost.destroy
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT 1  [["id", "6"]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 3]]