app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = ? AND "notifications"."id" = ? ORDER BY "notifications"."created_at" DESC LIMIT 1  [["user_id", 2], ["id", :is_read]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = ? AND (is_read = 'f')  [["user_id", 3]]
UPDATE "notifications" SET "is_read" = ?, "updated_at" = ? WHERE "notifications"."id" = 17  [["is_read", true], ["updated_at", Thu, 11 Feb 2016 13:24:07 UTC +00:00]]
---
  def update
    if(current_user.unread_notifications.any?)
      current_user.notifications.update_all(is_read: true)#.each {|notification| notification.update_attribute(:is_read, true) }