app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["password_digest", "$2a$10$vLf6XXnk0WoMcmqDqZ9Qk.tLzUcCPWTSYg2fca487jSH.iNtpFTqa"], ["updated_at", Thu, 11 Feb 2016 15:17:08 UTC +00:00]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)