app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    @user = User.find_by(id: params[:followed_id])

SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "5"]]
---
  def destroy
    @user = Relationship.find_by(id: params[:id]).followed