app/controllers/users_controller.rb

  def index
    @users = User.where(admin: false).paginate(page: params[:page], :per_page => 10)
---
SELECT "users".* FROM "users" WHERE (admin = 'f') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (admin = 'f')

  def show
    @user = User.find_by(id: params[:id])
    if @user
      @microposts = @user.microposts.descending.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 15]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 15]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 15]]

  def destroy
    user = User.find_by(id: params[:id])
    if user && user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

  def following
    @title = t(:following_title)
    @user  = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1

  def followers
    @title = t(:follower_title)
    @user  = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1