app/controllers/welcome_controller.rb

  def index
    if logged_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE (user_id = 15) ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships